{"meta":{"title":"Dro","subtitle":"Welcome to droplet world","description":"","author":"Dro","url":"https://droplet-dro.github.io","root":"/"},"pages":[{"title":"About Dro","date":"2025-10-23T11:00:00.000Z","updated":"2025-10-26T18:14:59.191Z","comments":true,"path":"about/index.html","permalink":"https://droplet-dro.github.io/about/index.html","excerpt":"","text":"「Dro」是「droplet」的縮寫，意思是一滴水。無論是知識、經驗，甚至人生的歷程，都是由一點一滴累積而成。這個名稱象徵着我們可以透過每一滴的積累，不斷成長，朝着「上善若水」的境界邁進。 Dro is short for “droplet”—a single drop of water. Just like knowledge, experience, and life itself, everything is built up drop by drop. This name reflects the belief that through these small accumulations, we grow continuously and strive to become someone who embodies the spirit of “supreme goodness is like water.” 目的 | Purpose這個平台不僅僅是一個部落格，更是一個不斷成長的社群，建立在好奇心、洞察力與分享精神之上。在這裡，您將發現深思熟慮的觀點、實用的知識，以及可自由使用的資源，旨在激發靈感並支持您的探索旅程。 This platform is more than just a blog — it’s a growing community built around curiosity, insight, and generosity. Here, you’ll discover thoughtful reflections, practical knowledge, and freely accessible resources designed to spark ideas and support your journey. 意義 | Meaning分享聽起來很簡單，但實際上受到許多複雜因素的影響：個人背景、知識深度、主觀偏見，以及理解的廣度與深度。真正的分享需要同理心、開放的態度，以及跨越差異的勇氣——這正是我希望在這裡培養的精神。 Sharing sounds simple, but in reality, it’s shaped by complex factors: personal backgrounds, levels of expertise, individual biases, and the scope or depth of understanding. True sharing requires empathy, openness, and the courage to bridge differences — and that’s exactly what we aim to cultivate here. 我分享的內容 | What We Share我的內容涵蓋多個具變革性的領域，旨在激發好奇心、促進理解，並鼓勵有意義的對話。這個平台致力於分享即時洞察、深度觀點與實用資源，特別聚焦於商業、人工智慧與數據領域。 Our content spans a range of transformative domains, each chosen to spark curiosity, foster understanding, and encourage meaningful dialogue. This platform is dedicated to sharing timely insights, thoughtful perspectives, and practical resources — with a particular focus on Business, Artificial Intelligence, and Data. 🔍 科技、AI 與產業趨勢 | Technology, AI &amp; Industry Trends 我探索科技領域的最新發展，不僅報導事件，更深入解析其意涵。主題包括：We explore the latest developments across the tech landscape, not just to report what’s happening, but to interpret what it means. Topics include: 正在重塑產業的 AI 與數據驅動技術新趨勢Emerging trends in AI and data-driven technologies reshaping industries 商業如何因應創新所帶來的挑戰與機遇Insights and commentary on how businesses are adapting to innovation 數位轉型前線的新聞與分析News and analysis from the frontlines of digital transformation 技術變革所引發的倫理、策略與社會層面反思Reflections on the ethical, strategic, and societal implications of technological change 🧠 思維交流與哲學探討 | Ideas, Perspectives &amp; Philosophy我相信深度交流的力量。這個空間歡迎多元觀點，鼓勵開放對話，並探討生命、倫理與意義等更深層的問題。無論是個人反思、哲學探討，或是大膽的觀點，我的目標是挑戰既有思維，並透過分享共同成長。 We believe in the power of thoughtful exchange. This space invites diverse viewpoints, encourages open dialogue, and explores deeper questions about life, ethics, and meaning. Whether it’s a personal reflection, a philosophical inquiry, or a bold opinion, our goal is to challenge assumptions and grow through shared understanding. 💰 財經知識 | Finance我致力於轉化複雜的金錢、金融市場與財務知識，變成簡單和易於理解的概念，幫助您掌握財經與科技、商業及日常生活之間的連結。 We aim to demystify money, markets, and financial literacy, offering approachable insights into how finance intersects with technology, business, and everyday life. 自我介紹 | About me我是一位資訊科技從業員，職業生涯始於軟件測試，隨後在IT項目執行與管理領域逐步發展。在這段期間，我由業務分析員開始累積經驗，之後轉型為項目經理。完成碩士學位後，我選擇踏上另一條跑道——前期銷售，展開了我在軟件測試、大數據分析和流程自動化方案前期銷售的大冒險。在這段旅程中，我學會了建立團隊、拓展人脈、追求自我成長，並協助公司拓展業務。 2019年，我決定專注於Data領域，發展個人興趣與專長。於是我從一家國際科技顧問公司轉職至一家以Data科技為核心的初創企業，擔任業務策略師。兩年後，我有幸加入國際大型科技公司Microsoft，成為技術銷售專員，專責推動Data與AI產品的業務發展。 這些經歷讓我深刻體會到科技發展日新月異，單向學習已難以追上其速度。正因如此，我更加重視「分享」的力量。透過分享，不僅能鞏固自身所學，也能讓他人有所收穫。 我希望透過分享各種事物，啟發更多人。我是一個以分享為樂的人，願意將每一滴累積的知識與經驗，化為成長的泉源。 I began my career in information technology as a software tester, gradually transitioning into IT project execution and management. During this phase, I gained valuable experience as a Business Analyst, which eventually led me to become a Project Manager. After completing my master’s degree, I boldly ventured into a new domain—presales—where I worked on solutions involving software testing, big data analytics, and process automation. This journey taught me how to build teams, expand networks, and pursue personal growth, all while helping the company scale its business. In 2019, I decided to focus on the data domain, aligning my personal interests with professional growth. I moved from an international tech consulting firm to a data-centric startup, where I served as a Business Strategist. Two years later, I was fortunate to join Microsoft, a global technology leader, as a Technical Specialist responsible for driving business development in Data and AI solutions. These experiences have made me deeply aware of how rapidly technology is evolving. Traditional one-way learning is no longer sufficient to keep pace. That’s when I discovered the power of sharing. By sharing what we learn, we reinforce our own understanding and help others grow as well. I believe in the value of sharing and hope that through my contributions, others can benefit too. I find joy in sharing—and I’m here to grow together, one droplet at a time."},{"title":"Tags","date":"2025-10-23T10:00:00.000Z","updated":"2025-10-23T10:53:29.242Z","comments":true,"path":"tags/index.html","permalink":"https://droplet-dro.github.io/tags/index.html","excerpt":"","text":""},{"title":"Categories","date":"2025-10-23T10:00:00.000Z","updated":"2025-10-25T21:58:25.522Z","comments":true,"path":"categories/index.html","permalink":"https://droplet-dro.github.io/categories/index.html","excerpt":"","text":""},{"title":"Coaching | 諮詢","date":"2025-10-23T11:00:00.000Z","updated":"2025-11-21T09:58:53.771Z","comments":true,"path":"coaching/index.html","permalink":"https://droplet-dro.github.io/coaching/index.html","excerpt":"","text":"諮詢服務 | Coaching Service有策略地規劃職涯轉型🔍 職涯方向 × 履歷優化 × 面試準備 × 科技業導向 👉 立即預約專屬職涯諮詢，為你的下一步做好準備 👈 我建立了一套專屬服務，協助正在轉職、尋求海外機會或探索科技業的你，釐清方向、建立信心，並制定具體策略。 無論你正在撰寫履歷、準備面試、思考職涯下一步，或是計劃移居海外工作或發展，我都能提供量身打造的建議與實用工具，幫助你突破現況。 適合對象 正在從非傳統背景轉職進入科技業，卻不知從何開始。 想申請海外職位，卻對履歷格式、面試文化或職場習慣感到陌生。 投遞履歷卻鮮少回應，想知道問題出在哪裡。 對目前工作感到穩定但停滯，想探索升遷、轉職或海外發展的可能性。 希望獲得真實、誠懇的建議，而非制式化的職涯建議。 關於我 | Know about me你好，我叫Dro，一位職涯策略顧問與科技業工作者，曾從 Software Testing 成功轉職至 Data &amp; AI。我曾在亞洲、歐洲和美洲工作過，深知職涯轉型與跨國求職的挑戰。 我已協助許多朋友突破瓶頸、進入競爭激烈的市場，並建立具吸引力的個人品牌。我的諮詢風格是同理、務實且具策略性，來自真實經驗的累積。 我是一位擁有工商管理碩士（MBA）學歷的資訊科技專業人士，具備超過二十年的業界經驗。目前，我持有多項專業認證，包括項目管理專業人員（PMP）、微軟認證講師（MCT），以及其他多項專業技術認證。 微軟認證： Azure AI Engineer Associate, Azure Data Engineer Associate Databricks 認證: Generative AI Solution Development Generative AI Application Development Generative AI Evaluation and Governance Generative AI Application Deployment and Monitoring Azure Databricks Platform Architect Accreditation Databricks Fundamentals Accreditation Data Science for Data Analysts Specialization 個人獎項與表彰 法國跨國IT企業: 專家認可(數位和流程自動化) (銀獎)創建成功的測試實踐 (銀獎)卓越的售前貢獻 (銅獎)最佳客戶管理(高優先客戶群) 國際投資銀行: 傑出表現員工獎 澳洲跨國IT企業: 年度最佳顧問 演講與思想領導經驗 本地大學客座講師：智能RPA和AI對商業發展的影響（商業和資訊管理本科生） 跨國投資公司：「AI 101」 諮詢主題每場諮詢都根據你的背景與需求量身打造，提供具體可行的建議與策略。 職涯定位諮詢（60 分鐘&#x2F;每節，GBP £69）： 釐清方向、解析產業趨勢、制定行動計畫。 模擬面試（60 分鐘&#x2F;每節，GBP £84）： 練習真實面試情境、優化回答、建立自信。 履歷與 LinkedIn 深度優化（60 分鐘&#x2F;每節＋回饋修正，GBP £84) Starter Pack 入門組合（3 小時&#x2F;每節，GBP £189）： 一次打包職涯定位、模擬面試與履歷優化三項服務，適合剛開始探索職涯轉型的你。 策略追蹤（30 分鐘&#x2F;每節，GBP £20）： 後續追蹤與策略微調。 👉 立即預約專屬職涯諮詢，為你的下一步做好準備 👈"}],"posts":[{"title":"Vibe Coding入門 (上）","slug":"20251121-0","date":"2025-11-21T10:01:36.000Z","updated":"2025-11-21T12:12:45.593Z","comments":true,"path":"2025/11/21/20251121-0/","permalink":"https://droplet-dro.github.io/2025/11/21/20251121-0/","excerpt":"","text":"Vibe Coding入門 今年，「Vibe coding」（又叫「氛圍編程」）被柯林斯詞典（Collins Dictionary）選為年度詞彙，這股新潮流在開發者圈裡掀起了不少討論。那 vibe coding 到底是什麼？簡單來說，它就是用 AI 來幫你寫程式、做軟體，甚至生成完整代碼——而且完全不需要傳統的程式設計背景。你只要用自然語言或語音描述想要的功能，AI 就能幫你把代碼生出來。聽起來像魔法，但今年它已經成了很多人日常的開發方式。 這個詞在今年2月突然爆紅，源自 OpenAI 前領導者安德烈·卡帕斯（Andrej Karpathy）的一條推文。他隨口用了「vibe coding」這個說法，結果迅速在網路上引發共鳴，甚至被視為程式設計的一場小革命。更有意思的是，OpenAI 在今年8月7日推出的 GPT‑5 模型，也特別針對 vibe coding 做了強化，讓這種「用語言寫程式」的方式更快、更準、更好用。 根據安德烈·卡帕斯（Andrej Karpathy）的說法，vibe coding 的核心就是「讓 AI 幫你寫程式」。流程很簡單：你先提出一個想法，然後把需求告訴 AI，它會生成代碼；接著你再審查代碼，把修改或修正的意見回饋給 AI，直到結果符合你的期待。換句話說，你不需要親自敲程式碼，而是用自然語言描述你想要的網站、應用程式或功能。卡帕斯甚至形容這種「放手讓 AI 全權處理」的體驗，就像是「完全沉浸在氛圍裡」。 當然，這種方式也引發了不少爭論。一方面，像卡帕斯這樣的支持者認為，AI 可以接手繁重的工作，讓人類專注於創意和探索；另一方面，批評者則指出，AI 生成的代碼有時難以理解、不可預測，真正的工程師應該能掌握並理解自己的代碼。 如果你想嘗試 vibe coding，其實門檻很低。只要能使用 AI 聊天機器人，就能立刻開始。小提醒：在動手之前，最好先想清楚你要實現的功能，這樣 AI 才能生成更精準的代碼。像 Mashable 就提供了專為初學者設計的 vibe coding 教程，值得一看。 另外，如果你想要更輕鬆的入門方式，Google 最近推出的 Opal 也是一個不錯的選擇。它的設計就像「填色遊戲」版的 vibe coding：你可以瀏覽別人創建的作品，或直接用模板開始。介面簡單直觀，非常適合新手上手。 Vibe Coding（氛圍編程）vs 傳統編程 面向 Vibe Coding（氛圍編程) 傳統編程 方式 使用自然語言或語音描述，由 AI 生成程式碼 人類工程師以程式語言手動撰寫程式碼 技能需求 不需要程式設計背景 需要掌握語法、邏輯與程式設計知識 工作流程 使用者提出想法 → AI 生成 → 使用者審查並回饋修正 工程師撰寫 → 測試 → 偵錯 → 優化 速度 原型開發快速，能迅速產出可用程式碼 速度取決於工程師的能力與時間投入 控制權 控制較少，AI 決定實作細節 完全掌握每一行程式碼 學習曲線 低，適合初學者或非技術背景者 高，需要長時間學習與練習 程式品質 可能不一致，有時難以理解或不可預測 較穩定、可維護性高 創意表現 專注於想法與成果，執行交由 AI 創意體現在設計與程式工藝 適用場景 快速原型、非技術使用者、概念驗證 複雜系統、效能要求高的應用、專業軟體開發 風險 程式碼可能不透明、難以除錯 雖需更多努力，但可靠性與可維護性較佳 熱門Vibe Coding 工具現在有不少熱門的 Vibe Coding 工具，例如 Bolt.new、Lovable、Cursor、Opal 等，它們都能讓使用者用自然語言快速生成程式碼或應用程式，非常適合初學者或想要快速原型開發的人 Bolt.new 在瀏覽器中直接生成程式碼，無需安裝環境 適合：快速原型、非技術背景的使用者 Lovable 強調「零程式碼」體驗，讓使用者專注於想法，AI 自動完成程式 適合：設計師、創業者，想快速測試產品概念 Cursor AI 驅動的程式編輯器，支援即時代碼生成與修改 適合：有程式基礎的開發者，加速工作流程 Opal（Google 推出） 介面像「填色遊戲」，提供模板與社群作品，降低入門門檻 適合：初學者，或想要輕鬆體驗 vibe coding Zapier Agents 結合自動化與 AI，能快速生成工作流程與應用 適合：需要整合多種工具的使用者 credit &amp; 延伸閱讀 : https://mashable.com/article/how-to-start-vibe-coding","categories":[{"name":"TechFunNews|科技趣聞","slug":"TechFunNews-科技趣聞","permalink":"https://droplet-dro.github.io/categories/TechFunNews-%E7%A7%91%E6%8A%80%E8%B6%A3%E8%81%9E/"}],"tags":[{"name":"GenAI","slug":"GenAI","permalink":"https://droplet-dro.github.io/tags/GenAI/"},{"name":"TechNews","slug":"TechNews","permalink":"https://droplet-dro.github.io/tags/TechNews/"}]},{"title":"ChatGPT：你不是混蛋啦～AI的道德判斷竟然這麼「佛系」？","slug":"20251117-2","date":"2025-11-17T18:30:00.000Z","updated":"2025-11-21T10:00:33.919Z","comments":true,"path":"2025/11/17/20251117-2/","permalink":"https://droplet-dro.github.io/2025/11/17/20251117-2/","excerpt":"","text":"你知道 Reddit 上有個超熱門版叫「Am I the Jerk?」嗎？網友會在那裡自爆一些爭議行為，然後請大家評評理：「我是不是混蛋？」 最近，史丹佛和普林斯頓的研究團隊突發奇想，把這些貼文丟給 AI 模型（像 ChatGPT、Claude、Gemini）來判斷。結果超出預期 - AI 竟然比人類還寬容!! AI怎麼判斷？Reddit 網友：你這行為超級混蛋，沒救了。 • ChatGPT：嗯…我覺得你不是壞人啦，也許只是誤會？ 研究發現，AI 模型在面對道德爭議時，傾向給貼文作者好評，彷彿在說：「你只是有點衝動，不是壞人啦～」 為什麼會這樣？ AI 被訓練時會避免冒犯人類，導致它在道德判斷上「太佛系」。 它不懂 Reddit 的社群文化，也不太會抓語境，結果就變成「懶好人」。 那我們還能信 AI 嗎？ 這研究提醒我們：AI 雖然聰明，但在「做人處事」這塊還是嫩嫩的。未來如果讓 AI 幫忙做決策，可能會出現「判太輕」的情況，甚至誤導使用者。 討論你的看法呢？你覺得 AI 應該要更「有原則」一點嗎？還是你喜歡它這種「不想傷人」的個性？留言告訴我：如果你在 Reddit 上貼了一篇爭議貼文，你希望 AI 怎麼評你? 延伸閱讀推薦：深入了解 AI 道德判斷與社會影響 UC Berkeley：AI有道德指南針嗎? Nature：ChatGPT 的道德建議影響使用者判斷 Stanford：AI心理健康工具的風險","categories":[{"name":"TechFunNews|科技趣聞","slug":"TechFunNews-科技趣聞","permalink":"https://droplet-dro.github.io/categories/TechFunNews-%E7%A7%91%E6%8A%80%E8%B6%A3%E8%81%9E/"}],"tags":[{"name":"GenAI","slug":"GenAI","permalink":"https://droplet-dro.github.io/tags/GenAI/"},{"name":"TechNews","slug":"TechNews","permalink":"https://droplet-dro.github.io/tags/TechNews/"}]},{"title":"Chapter 1 - 想當年．．.","slug":"20251117-1","date":"2025-11-17T09:30:00.000Z","updated":"2025-11-21T10:00:45.023Z","comments":true,"path":"2025/11/17/20251117-1/","permalink":"https://droplet-dro.github.io/2025/11/17/20251117-1/","excerpt":"","text":"一切由軟件測試開始剛剛出身到社會做事，我在IT界中的第一個崗位是一個Functional Tester。當時我還是一位「𡃁仔」，老闆知道我無論對金融業務認識或是部門所開發的applications的認識還很淺。所以老闆一開始就要我聚焦兩項工作上 - Application FAQ deployment和Fuctional Testing。開頭我真係覺得好悶，因為兩項工作都係一啲「手作野」。但係一諗起難得可以喺國際投資銀行工作都唔係一件容易嘅事，所以我都好俾心機去做。我仲記得當時部門所開發的applications都係行Java為主(架構係當時流行嘅three tier。Web 同 App server都係用IBM嘅websphere(當年好受企業歡迎，即使現在政府也有一些系統還有在跑這個產品)。Database 當然係用Oracle Enterprise。仲有不得不提就係所有Server係行Sun Solaris(當年同人講話玩過太陽機，係一件好威嘅事)。 我嘅學習起點就係由宏觀都微觀，線學習SDLC喺企業世界係點運用，然後喺每一個階段入邊我用 6W方法 (Why, What, Who, How, When, Where)去了解當中嘅細節。呢種high Level學習方法，至少幫我呢個新丁可以聽得明、看得懂其他人喺度做緊乜嘢。而且要溝通起上嚟我亦都可以答到嘴。而且正正對我兩項工作都有無比嘅幫助。 先講講Application FAQ deployment，其實好簡單，我就係需要負責晒所有applications所需要的faq做encoding conversation，然後將分類好嘅資料打包，再deploy去唔同嘅environment以供使用。單單係呢個工作過程入面，我就已經需要學識點樣用sql去Oracle搵資料，再自行搵方法去檢查同轉換一些特別字完，然後再將呢啲整理好嘅資料透過putty上載到Web Server，再去console做一些config。幾個步驟看似簡單，但係對於乜都唔識嘅我就覺得好有挑戰性。 軟件測試開始就係咁就過咗一年．．．(待續)","categories":[{"name":"Career|職涯生活","slug":"Career-職涯生活","permalink":"https://droplet-dro.github.io/categories/Career-%E8%81%B7%E6%B6%AF%E7%94%9F%E6%B4%BB/"}],"tags":[{"name":"職涯生活","slug":"職涯生活","permalink":"https://droplet-dro.github.io/tags/%E8%81%B7%E6%B6%AF%E7%94%9F%E6%B4%BB/"},{"name":"Career","slug":"Career","permalink":"https://droplet-dro.github.io/tags/Career/"}]},{"title":"歡迎來到 Dro：一滴一世界，從這裡開始","slug":"20251116-0","date":"2025-11-16T00:00:00.000Z","updated":"2025-11-21T09:59:37.012Z","comments":true,"path":"2025/11/16/20251116-0/","permalink":"https://droplet-dro.github.io/2025/11/16/20251116-0/","excerpt":"","text":"你現在來到的是 Dro，這個名字來自英文的「droplet」，意思是一滴水。為什麼是一滴水？因為我一直相信，無論是知識、經驗，還是人生的故事，都是一點一滴慢慢累積起來的。沒有哪個人一開始就什麼都懂，也沒有人能一口氣走完所有的路。我們都是靠著每一滴的努力、每一次的嘗試，才慢慢變成今天的自己。 這個部落格，就是我想把這些「滴滴」記錄下來的地方。 說實話，隨著科技發展越來越快，我發現光靠自己吸收資訊，真的很容易跟不上。每天都有新東西、新工具、新觀念冒出來，學不完也記不住。後來我發現，最有效的方式其實是——分享。 當我試著把學到的東西講給別人聽，或寫下來整理成文章，不但幫助自己釐清思緒，也常常意外地幫助到別人。這種「你一點、我一滴」的交流，讓我覺得很有意義。 這裡會分享些什麼? 老實說，什麼都有可能（笑）。這裡不會只侷限在某一個主題，因為我本來就對很多事情都很好奇。可能會有：💡 學習筆記：像是我最近在研究的科技工具、AI、數位生產力..還有實用資源等等🌱 生活觀察：日常中的小發現、觀點、實用知識 覺得值得分享的想法等等✨ 思維交流與哲學探討：透過分享挑戰既有思維，並透過分享共同成長 總之，這裡就像是一個開放的筆記本，歡迎你隨時翻閱，也歡迎你留言、交流，甚至提出不同的觀點。因為我相信，真正的學習和成長，從來都不是一個人的事。 這裡你會看到以繁體中文為主的內容，搭配適時的 English posts，讓語言成為橋樑，而不是界線。無論你是中文使用者，還是英文讀者，都能在這裡找到屬於自己的閱讀節奏。我預計每週更新一次，有時候靈感來了，也可能會有一週多篇的驚喜出現。 最後，謝謝你來到這裡 如果你也喜歡這種一點一滴的累積，喜歡在日常中發現不一樣的風景，那我們應該會很合得來。謝謝你來到這裡，願我們都能在這片水域中，找到屬於自己的節奏與方向。","categories":[],"tags":[{"name":"Dro","slug":"Dro","permalink":"https://droplet-dro.github.io/tags/Dro/"},{"name":"Welcome","slug":"Welcome","permalink":"https://droplet-dro.github.io/tags/Welcome/"}]}],"categories":[{"name":"TechFunNews|科技趣聞","slug":"TechFunNews-科技趣聞","permalink":"https://droplet-dro.github.io/categories/TechFunNews-%E7%A7%91%E6%8A%80%E8%B6%A3%E8%81%9E/"},{"name":"Career|職涯生活","slug":"Career-職涯生活","permalink":"https://droplet-dro.github.io/categories/Career-%E8%81%B7%E6%B6%AF%E7%94%9F%E6%B4%BB/"}],"tags":[{"name":"GenAI","slug":"GenAI","permalink":"https://droplet-dro.github.io/tags/GenAI/"},{"name":"TechNews","slug":"TechNews","permalink":"https://droplet-dro.github.io/tags/TechNews/"},{"name":"職涯生活","slug":"職涯生活","permalink":"https://droplet-dro.github.io/tags/%E8%81%B7%E6%B6%AF%E7%94%9F%E6%B4%BB/"},{"name":"Career","slug":"Career","permalink":"https://droplet-dro.github.io/tags/Career/"},{"name":"Dro","slug":"Dro","permalink":"https://droplet-dro.github.io/tags/Dro/"},{"name":"Welcome","slug":"Welcome","permalink":"https://droplet-dro.github.io/tags/Welcome/"}]}